package day0404;

public class Ex02 {}
/*
	클래스( Class ) 
		- 객체를 만들기 위한 틀(설계도)
	 	- 객체의 속성(변수)과 기능(메서드)을 정의
	 	- 클래스는 객체(인스턴스)를 생성하기 위한 청사진 역할
	 	
	 클래스 정의
	 	class 클래스명 {
	 		// 변수
	 		데이터 타입 변수명;
	 		
	 		// 생성자
	 		클래스명(){}
	 		
	 		// 메서드
	 	}
	 
	 클래스 명명 규칙
	 	- 첫글자 대문자로 시작( 필수X, 관례O )
	 	- 변수 명명 규칙과 같다.
	 
	 클래스 용도	-2가지
	 	1. 라이브러리 클래스
	 		- 다른 클래스에서 사용하기 위해 만들어진 클래스
	 		- 실행되지 않음( main() 메서드 없음 )
	 		- 객체를 생성하여 사용
	 	
	 	2. 실행 클래스
	 		- 프로그램을 실행하는 클래스 
	 		- 반드시 main() 메서드 가져야함
	 		- 라이브러리 클래스 사용하여 프로그램을 실행
	 
	 클래스와 객체
	 	클래스(class)
	 		- 객체를 만들기 위한 설계도 : 붕어빵 틀
	 	객체(object)
	 		- 클래스를 기반으로 실제 생성된 것(인스턴스) : 붕어빵(실제 만들어진 인스턴스) 
	 		

















*/
