package day0404;

public class Ex03 {}
/*
 	객체를 생성하는 방법
 		1. 객체 선언 후 생성
 			클래스이름 변수명;
 			변수명 = new 클래스이름();
 		2. 객체 생성과 선언 동시에 하기
 			클래스타입 변수명 = new 클래스명();
 		** 이때, 변수는 생성된 객체를 참조할 변수(참조 변수)
 		 
 	new 연산자
 		- 객체를 생성할 때 사용 -> 생성자 호출!
 		- new 뒤에는 생성자가 반드시 와야함
 		- new 연산자로 생성된 객체는 힙(heap) 영역에 저장
 		- new 연산자로 생성한 객체는 생성된 객체의 주소값을 반환(리턴)
 		
 	new 연산자의 동작 과정
 		- new 사용하면 객체가 메모리(힙)에 생성
 		- 생성된 객체의 주소값 반환(리턴)되어 참조 변수에 저장
 		- 참조 변수를 이용해 객체를 사용 
 		
 		
 	
















*/
