package day0325;

public class VarEx01 {
	public static void main(String[] args) {
		System.out.println("hello java");
	}
}


// 한줄 주석//
/* 문단 주석 
 들여쓰기 : Tab키
 실행문
 	- 반드시 ;(세미콜론)마무리.
 	- 변순 선언, 값 저장(대입) 등등 앞으로 보게될 모든 코드들을 말함.
 	
 .(도트/닷 연산자)
  - 알고 있는 것, 가지고 있는 것
  D.godsu.javaex.space.javeEx.src.day0325
  
  변수 (Variable)
  	- 오직 하나의 값만 가지는 메모리 공간.
  형태 
  	- 선언 : 데이터타입 변수명;  :자바는 자료형(int,double 등) 지정
  	- 대입 : 변수명 = 값;     : 자료형에 맞는 값을 넣는다.
  	- 선언과 대입은 한번에도 가능하다.
  변수 이름
  	- 소문자 사용
  	- 첫글자는 문자 사용(첫글자 숫자X)
  	- 특수문자 $ _ 두가지만 사용가능
  	- 중복 불가능
  	- 예약어 사용 불가
  	데이터 타입, 접근 제어자, 제어문 관련.., 클래스 관련..
  	- 카멜 표기법
  	프로그래밍에서 파일, 변수, 메서드 등등 이름을 사용할 때 여러 단어를 연달아 사용할때
  	여러 단어를 연달아 사용할때 각 단어의 첫 글자는 대문자로 적는다. ex)yoYoYoYo
  	- 스네이크 표기법
  	띄어쓰기를 언더바(_)로 표기
  
  변수의 특징
  	- 선언만 하고 값이 대입되지 않으면 사용 불가.
  	- 초기화 되어야 읽기(사용) 가능.
  	최초의 값을 저장하거나 대입
  	선언과 동시에 / 사용 전에 둘 다 가능
  	- 대입은 여러번 가능
  	마지막 대입 값으로 변경됨
  	- 같은 타입끼리 대입 가능. 값의 복사
  	- 사용 범위
  	선언된 블록/영역 {} 내에서만 사용 가능
  클래스 이름
   	- 첫글자 대문자 사용
   	- 그외 규칙은 변수의 명명규칙과 동일
 */















